{
  "header": {
    "schemaVersion": 2,
    "dateCreated": "2025-07-03T04:11:29.3881789Z",
    "projectFile": "..\\tests\\samples\\thedoor.project.json"
  },
  "outlineProgress": "PremiseExpanded",
  "premise": "The Oakwood Apartments, a nondescript building tucked away on a quiet street, seemed an unlikely stage for anything extraordinary. Yet, as the summer sun painted the faded bricks in shades of gold, a palpable tension simmered beneath the surface. The residents, a collection of eccentric souls with stories etched in the lines of their faces, watched with a mix of curiosity and veiled caution as the new carpenter, Jason, began his work on a vacant unit. Initially, the job appeared straightforward—fresh paint, new fixtures, a simple upgrade to a tired space. But as Jason tore through the walls, unearthing decades of forgotten history, he stumbled upon an ancient door, warped and inconspicuous, hidden in a dimly lit hallway. Despite the residents’ dismissive remarks, he felt an inexplicable pull towards it, an urge to delve deeper into the shadows of his own past. \n\nWhen he finally turned the handle, he was transported back to sun-drenched afternoons and laughter that echoed through time, reliving cherished moments that slipped away too swiftly. But the enchantment soon turned sour, as darker memories clawed their way to the surface—painful truths he had long suppressed. Just as he was on the brink of understanding, the door vanished, leaving him with a haunting sense of loss and a heart heavy with regret. As he emerged into the stark reality of the present, he found himself irrevocably changed—stripped of his past yet burdened by its weight. Unbeknownst to him, a new carpenter was arriving, a stranger with an uncanny resemblance to Jason, while in the shadows of Oakwood, a mysterious old man bore his name, hinting at a cycle of memory and identity that was far from over. The air grew thick with unspoken secrets, the walls whispering tales of lives intertwined, as the building continued to breathe, alive with its own enigmatic rhythm.",
  "totalWordCount": 60000,
  "chapterCount": 20
}